In [15]:
%load_ext sql
%sql postgresql+psycopg2://localhost:5432/intro_to_sql_for_analytics
import timeit
from sqlalchemy import create_engine
import pandas as pd

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

## Use a SELF JOIN to find athletes that share a birthday.

In [16]:
%%sql
SELECT date_of_birth, athlete_count, name
FROM (
    SELECT
        date_of_birth,
        COUNT(*) OVER (PARTITION BY date_of_birth) AS athlete_count,
        name
    FROM athletes
    GROUP BY date_of_birth, name
    ) AS subquery
WHERE athlete_count > 1
ORDER BY date_of_birth, name
LIMIT 10;

 * postgresql+psycopg2://localhost:5432/intro_to_sql_for_analytics
10 rows affected.

[(datetime.date(1964, 7, 5), 2, 'CHEBANIKA Raisa'),
 (datetime.date(1964, 7, 5), 2, 'SIM Jae Yong'),
 (datetime.date(1967, 10, 12), 2, 'PILLE-STEPPAT Sylvia'),
 (datetime.date(1967, 10, 12), 2, 'SCHNARNDORF Susana'),
 (datetime.date(1970, 3, 24), 2, 'FENDT Bernhard'),
 (datetime.date(1970, 3, 24), 2, 'POMME Mauricio'),
 (datetime.date(1970, 4, 21), 2, 'BACHMAIER Ernst'),
 (datetime.date(1970, 4, 21), 2, 'CHIPPINGTON Jeanette'),
 (datetime.date(1972, 6, 8), 2, 'ANDALOUSSI Ahmed'),
 (datetime.date(1972, 6, 8), 2, 'RODRIGUEZ Matthew')]

In [17]:
%%sql
SELECT alias_a.date_of_birth, COUNT(*) AS athlete_count
FROM athletes alias_a INNER JOIN athletes alias_b ON alias_a.name = alias_b.name AND alias_a.date_of_birth = alias_b.date_of_birth
GROUP BY alias_a.date_of_birth
HAVING COUNT(*) > 1
LIMIT 10;

 * postgresql+psycopg2://localhost:5432/intro_to_sql_for_analytics
10 rows affected.

[(datetime.date(1964, 7, 5), 2),
 (datetime.date(1966, 10, 21), 4),
 (datetime.date(1967, 10, 12), 2),
 (datetime.date(1968, 1, 23), 4),
 (datetime.date(1968, 11, 12), 4),
 (datetime.date(1970, 3, 24), 2),
 (datetime.date(1970, 4, 21), 2),
 (datetime.date(1970, 12, 26), 4),
 (datetime.date(1971, 6, 23), 4),
 (datetime.date(1972, 6, 8), 2)]

In [18]:
%%sql 
SELECT alias_a.name athletes, alias_a.date_of_birth, alias_b.name athelete_two, alias_b.date_of_birth
FROM athletes alias_a INNER JOIN athletes alias_b
ON alias_a.date_of_birth =  alias_b.date_of_birth
WHERE alias_a.name != alias_b.name
ORDER BY alias_a.date_of_birth DESC
LIMIT 10

 * postgresql+psycopg2://localhost:5432/intro_to_sql_for_analytics
10 rows affected.

[('LEBRUN Tatyana', datetime.date(2004, 12, 9), 'HUANG Wenjuan', datetime.date(2004, 12, 9)),
 ('HUANG Wenjuan', datetime.date(2004, 12, 9), 'LEBRUN Tatyana', datetime.date(2004, 12, 9)),
 ('FOLGADO GARCIA Nagore', datetime.date(2004, 3, 23), 'CHALLIS Ellie', datetime.date(2004, 3, 23)),
 ('CHALLIS Ellie', datetime.date(2004, 3, 23), 'FOLGADO GARCIA Nagore', datetime.date(2004, 3, 23)),
 ('FELIX BARBOSA da SILVA Jardenia', datetime.date(2003, 9, 9), 'HONTAR Anna', datetime.date(2003, 9, 9)),
 ('HONTAR Anna', datetime.date(2003, 9, 9), 'FELIX BARBOSA da SILVA Jardenia', datetime.date(2003, 9, 9)),
 ('PEARSE Col', datetime.date(2003, 7, 10), 'CORSO Liza', datetime.date(2003, 7, 10)),
 ('CORSO Liza', datetime.date(2003, 7, 10), 'PEARSE Col', datetime.date(2003, 7, 10)),
 ('de LIMA Lara Aparecida', datetime.date(2003, 4, 25), 'TOPF Josia Tim Alexander', datetime.date(2003, 4, 25)),
 ('TOPF Josia Tim Alexander', datetime.date(2003, 4, 25), 'de LIMA Lara Aparecida', datetime.date(2003, 4, 25))]

In [19]:
%%sql
SELECT alias_a.date_of_birth, COUNT(*) AS athlete_count, STRING_AGG(alias_a.name, ', ') AS athlete_names
FROM athletes alias_a INNER JOIN athletes alias_b ON alias_a.name = alias_b.name AND alias_a.date_of_birth = alias_b.date_of_birth
GROUP BY alias_a.date_of_birth
HAVING COUNT(*) > 1
LIMIT 10;

 * postgresql+psycopg2://localhost:5432/intro_to_sql_for_analytics
10 rows affected.

[(datetime.date(1964, 7, 5), 2, 'SIM Jae Yong, CHEBANIKA Raisa'),
 (datetime.date(1966, 10, 21), 4, 'GARRIDO MARQUEZ Victor Hugo, GARRIDO MARQUEZ Victor Hugo, GARRIDO MARQUEZ Victor Hugo, GARRIDO MARQUEZ Victor Hugo'),
 (datetime.date(1967, 10, 12), 2, 'PILLE-STEPPAT Sylvia, SCHNARNDORF Susana'),
 (datetime.date(1968, 1, 23), 4, 'TEUBER Michael, TEUBER Michael, TEUBER Michael, TEUBER Michael'),
 (datetime.date(1968, 11, 12), 4, 'BERENYI Joseph, BERENYI Joseph, BERENYI Joseph, BERENYI Joseph'),
 (datetime.date(1970, 3, 24), 2, 'FENDT Bernhard, POMME Mauricio'),
 (datetime.date(1970, 4, 21), 2, 'CHIPPINGTON Jeanette, BACHMAIER Ernst'),
 (datetime.date(1970, 12, 26), 4, 'SUGIURA Keiko, SUGIURA Keiko, SUGIURA Keiko, SUGIURA Keiko'),
 (datetime.date(1971, 6, 23), 4, 'KEITH Aaron, KEITH Aaron, KEITH Aaron, KEITH Aaron'),
 (datetime.date(1972, 6, 8), 2, 'RODRIGUEZ Matthew, ANDALOUSSI Ahmed')]

In [20]:
%%timeit -n 1 -r 1
result = %sql SELECT date_of_birth, athlete_count, name FROM (SELECT date_of_birth, COUNT(*) OVER (PARTITION BY date_of_birth) AS athlete_count, name FROM athletes GROUP BY date_of_birth, name) AS subquery WHERE athlete_count > 1 ORDER BY date_of_birth, name

 * postgresql+psycopg2://localhost:5432/intro_to_sql_for_analytics
1461 rows affected.
9.33 ms ± 0 ns per loop (mean ± std. dev. of 1 run, 1 loop each)

In [21]:
%%timeit -n 1 -r 1
result = %sql SELECT alias_a.date_of_birth, COUNT(*) AS athlete_count FROM athletes alias_a INNER JOIN athletes alias_b ON alias_a.name = alias_b.name AND alias_a.date_of_birth = alias_b.date_of_birth GROUP BY alias_a.date_of_birth HAVING COUNT(*) > 1

 * postgresql+psycopg2://localhost:5432/intro_to_sql_for_analytics
747 rows affected.
7.48 ms ± 0 ns per loop (mean ± std. dev. of 1 run, 1 loop each)

In [22]:
%%timeit -n 1 -r 1
result = %sql  SELECT alias_a.name athletes, alias_a.date_of_birth, alias_b.name athelete_two, alias_b.date_of_birth FROM athletes alias_a INNER JOIN athletes alias_b ON alias_a.date_of_birth =  alias_b.date_of_birth WHERE alias_a.name != alias_b.name ORDER BY alias_a.date_of_birth DESC

 * postgresql+psycopg2://localhost:5432/intro_to_sql_for_analytics
1888 rows affected.
7.9 ms ± 0 ns per loop (mean ± std. dev. of 1 run, 1 loop each)

In [23]:
%%timeit -n 1 -r 1
result = %sql SELECT alias_a.date_of_birth, COUNT(*) AS athlete_count, STRING_AGG(alias_a.name, ', ') AS athlete_names FROM athletes alias_a INNER JOIN athletes alias_b ON alias_a.name = alias_b.name AND alias_a.date_of_birth = alias_b.date_of_birth GROUP BY alias_a.date_of_birth HAVING COUNT(*) > 1

 * postgresql+psycopg2://localhost:5432/intro_to_sql_for_analytics
747 rows affected.
10.5 ms ± 0 ns per loop (mean ± std. dev. of 1 run, 1 loop each)